
// for 반복문
// for (초기식; 조건식; 증감식;) { 반복적으로 실행해야 되는 코드 }

// for문을 만나면 초기식에 적어놓은 변수를 세팅함
// 실행 순서 : 초기식 -> 조건식 -> 실행코드 -> 증감식 -> 조건식 -> 실행코드 -> 조건식이 false면 끝
// 초기식 : 하나의 변수를 할당해서 값을 집어넣는 식
// 조건식 : 반복을 해도 되는지 따지는 식 -> 초기식의 변수를 통한 비교식을 세움
for (var i = 1; i <= 3; i++) {
    console.log(i+"번째 반복");
}

// 1. 초기식 때 i =1
// 2. 조건문에서 1<= 3 을 보면 true값 '실행해도 된다'      ㄱ
// 3. 코드블록인 console.log(1번째 반복");이 실행됨     1사이클
// 4. 증감식이 i++이 실행되어 i = 2                      ㄴ
// 5. 족선문에서 2<= 3 을 보면 ture값 '실행이 된다         ㄱ
// 6. 코드블록인 console.log(2번째 반복");이 실행됨     2사이클
// 7. 증감식인 i++이 실행되어 i =3                       ㄴ
// 8. 조건뭉에서 3<=3dmf 보면 ture값 '실행도 된다'        ㄱ
// 9. 코드블럭인 console.log("3번째 반복"); 이 실행됨   3사이클
// 10. 증감식이 i++리 실행되어 i = 4                     ㄴ
// 11. 조건뭉에서 4<=4를 보면 false값이 되어 '끝내'가 된다      => 4사이클에서 마무리 지어짐


// 1부터 10 까지 더하기
var sum =0;
for (var n=1; n <= 10; n++) {
    sum +=n;    // sum =sum + n;
    console.log(sum);
}
// 첫번째 사이클 : sum = sum + n"  // sum 0, n 1 = 0+1 =1
// 두번째 사이클 : sum = sum + n"  // sum 1, n 2 = 1+2 =3
// 세번째 사이클 : sum = sum + n"  // sum 3, n 3 = 3+4 =6
// 네번째 사이클 : sum = sum + n"  // sum 6, n 4 = 6+4 =10
// 다섯번째 사이클 : sum = sum + n"  // sum 10, n 5 = 10+5 =15-const
// 여섯번째 사이클 : sum = sum + n"  // sum 15-const, n 6 = 15-const+6 =21




// 중첩 반복문 : 그냥 for문 안에 for문을 쓰는 것

// 구구단! 2단만 만들어 보면
for (var dan =2; dan <= 9; dan++) {
    for (k = 1; k <= 9; k++) {
        console.log(`${dan} * ${k} = ${dan * k}`);
    }
}